app/views/pages/explore.html.erb

                    <h4>
                        <div class="countdown" data-countdown="<%= Post.find(@p.id).expires_at %>"></div>
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ?  ORDER BY "posts"."created_at" DESC LIMIT 1  [["id", 15]]

                        <span class="g-links" style="font-size:80%" aria-hidden="true">
                            by <%= User.find(@p.user_id).username %> on <%= @p.created_at.strftime("%m-%d-%Y") %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]