app/views/pages/home.html.erb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ?  ORDER BY "posts"."created_at" DESC LIMIT 1  [["id", 15]]
---
                    <h4>
                        <div class="countdown" data-countdown="<%= Post.find(@p.id).expires_at %>"></div>

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]
---
                        <span class="g-links" style="font-size:80%" aria-hidden="true">
                            by <%= User.find(@p.user_id).username %> on <%= @p.created_at.strftime("%m-%d-%Y") %>