app/controllers/posts_controller.rb

    def create
        @post = Post.new(post_params)
        @post.user_id = current_user.id # assign post to user who created it
        @post.save
---
INSERT INTO "posts" ("content", "expires_at", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "still testing"], ["expires_at", "2018-03-28 05:10:00.000000"], ["user_id", 2], ["created_at", "2017-03-28 05:11:09.928604"], ["updated_at", "2017-03-28 05:11:09.928604"]]