app/views/layouts/_popular.html.erb

        <h4>Popular</h4>
        <% Post.reorder(:cached_votes_total => :desc).limit(5).each do |post| %>
---
SELECT "posts".* FROM "posts"  ORDER BY "posts"."created_at" DESC